{
  "backend/main.mo": "Actor imports and includes the MixinStorage blob-storage mixin, exposing storage capabilities.",
  "feature_evidence.json": "Feature evidence report describing a Google Reviews link update and listing affected file, components, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including styles, components, pages, and data modules.",
  "frontend/index.css": "Tailwind base setup defining extensive OKLCH theme variables for light and dark modes and applying global background/foreground styles.",
  "frontend/index.html": "Main HTML entry file with favicon, SEO metadata, Open Graph/Twitter tags, and script loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router with layout and page routes, including validated search parameters, and renders RouterProvider.",
  "frontend/src/components/BrandLogo.tsx": "Brand logo component with size variants and fallback text-based mark if the image fails.",
  "frontend/src/components/GalleryImage.tsx": "Gallery image card with loading state, error fallback, hover effects, and optional click handling.",
  "frontend/src/components/HeaderSearch.tsx": "Search form with controlled input and submit handler returning trimmed query.",
  "frontend/src/components/LogoMotif.tsx": "Decorative logo motif component with opacity styling and text fallback on load error.",
  "frontend/src/components/MenuCategoryCarousel.tsx": "Carousel for menu categories supporting keyboard/swipe navigation and rendering items with price badges.",
  "frontend/src/components/MenuScreenshotGallery.tsx": "Gallery that displays a single menu screenshot with loading and graceful error fallback.",
  "frontend/src/components/Section.tsx": "Reusable section wrapper applying consistent vertical spacing and container layout.",
  "frontend/src/components/Seo.tsx": "React component that updates document title and meta/OG tags based on provided SEO props.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with brand info, social links, navigation links, and contact details.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with navigation, search, CTAs, and a mobile slide-out menu.",
  "frontend/src/components/WatermarkBackground.tsx": "Displays layered low-opacity repeating watermark images fixed behind all content.",
  "frontend/src/data/menuData.ts": "Defines menu categories and items with descriptions and pricing for the restaurant menu.",
  "frontend/src/draft24-exclusions.md": "Notes which changes were excluded during restoration to Draft 24 and lists included features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useHorizontalSwipe.ts": "Provides a ref that detects left/right swipe gestures based on touch events.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context provider and hook for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, and light/dark theme CSS variables for the app’s visual design.",
  "frontend/src/lib/brandAssets.ts": "Exports constants containing paths to brand images and a list of gallery image metadata.",
  "frontend/src/lib/globalSearchContent.ts": "Builds search results for menu items, offers, and pages by normalizing text and matching against predefined data sources.",
  "frontend/src/lib/menuPdf.ts": "Empty placeholder for menu PDF-related functionality.",
  "frontend/src/lib/menuPrice.ts": "Formats menu item prices, supporting numeric values, labels, and fallbacks.",
  "frontend/src/lib/menuScreenshotAssets.ts": "Exports an ordered list of menu screenshot asset URLs for consistent display.",
  "frontend/src/lib/socialLinks.ts": "Provides a centralized set of social media link URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with restaurant story content, values, and styled sections using shared UI components.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with location, phone, hours, quick actions, and a map section using cards and icons.",
  "frontend/src/pages/GalleryPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with hero branding, cuisine sections, feature stats, and CTA buttons for booking and ordering.",
  "frontend/src/pages/MenuPage.tsx": "Displays the restaurant menu with search filtering, screenshot gallery, category carousel, and ordering CTA.",
  "frontend/src/pages/OffersPage.tsx": "Shows a list of promotional offers with icons, descriptions, badges, and terms and conditions.",
  "frontend/src/pages/SearchPage.tsx": "Implements global search across menu items, offers, and pages with categorized results and a search form.",
  "frontend/src/types/pdf-lib-global.d.ts": "Empty type declaration file for pdf-lib integration.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theme colors, fonts, radii, shadows, and animations while enabling dark mode and plugin support.",
  "project_state.json": "Project metadata storing feature lists, state versioning, and a pending request to add a Google review link section."
}