{
  "backend/main.mo": "Motoko actor managing users and menu data with access-controlled CRUD operations for profiles, items, and categories.",
  "feature_evidence.json": "Feature report mapping feature requests to related files, components, and test IDs for tracking changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, styling, routing, and UI components in the project.",
  "frontend/index.css": "Global Tailwind-based color tokens and theme variables defining light/dark styles for the app.",
  "frontend/index.html": "App entry HTML with favicon, SEO metadata, Open Graph/Twitter tags, and root mount point.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and React Query provider with shared layout.",
  "frontend/src/components/BrandLogo.tsx": "Logo component showing an image with fallback text-based mark and responsive size options.",
  "frontend/src/components/GalleryImage.tsx": "Empty placeholder file for a gallery image component.",
  "frontend/src/components/LogoMotif.tsx": "Decorative logo motif component rendering a low-opacity logo with fallback text if loading fails.",
  "frontend/src/components/menu/MenuCategoryIcon.tsx": "Shows a menu category icon from a sprite sheet or a fallback dot if the icon key is missing.",
  "frontend/src/components/Section.tsx": "Reusable layout wrapper providing consistent section spacing and container width.",
  "frontend/src/components/Seo.tsx": "SEO utility that updates page title and meta tags (description and Open Graph) on mount.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with brand info, social links, quick navigation, and contact details.",
  "frontend/src/components/SiteHeader.tsx": "Provides a responsive header with navigation, mobile menu, and conditional admin links based on identity.",
  "frontend/src/components/WatermarkBackground.tsx": "Displays layered, low-opacity repeating watermark background images for visual depth.",
  "frontend/src/data/menuData.ts": "Defines menu category and item data structures and exports the full menu configuration with images and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for user profiles, admin checks, and menu retrieval and updates using the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, fonts, and extensive light/dark theme CSS variables for the app’s color system.",
  "frontend/src/lib/brandAssets.ts": "Exports paths for logo, favicon, and hero images as central brand assets.",
  "frontend/src/lib/menuAdapters.ts": "Provides helpers to convert menu data between frontend and backend formats and to merge backend data with defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with restaurant story content, values, and styled sections.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, quick actions, and location info for the restaurant.",
  "frontend/src/pages/GalleryPage.tsx": "Empty placeholder file for a gallery page.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero, cuisine highlights, and call‑to‑action buttons.",
  "frontend/src/pages/MenuManagementPage.tsx": "Admin interface for editing, saving, and syncing menu data with authentication and profile setup logic.",
  "frontend/src/pages/MenuPage.tsx": "Renders the menu page by fetching backend menu data, merging it with defaults, and displaying categories in both desktop grid and mobile accordion layouts with images, icons, and item details.",
  "frontend/src/pages/OffersPage.tsx": "Displays a list of promotional offers with icons and descriptions, along with SEO metadata, a hero section, and terms and conditions.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, retrieving, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, fonts, animations, container settings, and plugin integrations.",
  "project_state.json": "Captures project metadata, feature requirements, image needs, and architectural notes for the restaurant menu system."
}