{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report linking gallery-related fixes to specific frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files and their roles.",
  "frontend/index.css": "Tailwind base styles defining color tokens for light and dark themes using OKLCH values.",
  "frontend/index.html": "Main HTML entry file with favicon, SEO meta tags, and root mount point.",
  "frontend/src/App.tsx": "Application router defining layout and all main page routes using TanStack Router.",
  "frontend/src/components/BrandLogo.tsx": "Logo component with size variants and fallback text rendering if the image fails.",
  "frontend/src/components/GalleryImage.tsx": "Image component for the gallery with error handling and a visual fallback.",
  "frontend/src/components/LogoMotif.tsx": "Decorative logo motif component with fallback to a text mark when the image fails.",
  "frontend/src/components/Section.tsx": "Reusable section wrapper providing padded containers for page layout.",
  "frontend/src/components/Seo.tsx": "Runtime SEO helper that updates document title and meta tags for each page.",
  "frontend/src/components/SiteFooter.tsx": "Footer with branding, navigation links, social icons, and contact information.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header component with navigation links, mobile sheet menu, and action buttons for ordering, booking, and calling.",
  "frontend/src/data/menuData.ts": "Defines menu category and item interfaces and exports a large dataset of menu categories with items and pricing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks with no current functionality.",
  "frontend/src/index.css": "Tailwind-based global styling with custom color variables, dark mode definitions, and typography settings.",
  "frontend/src/lib/brandAssets.ts": "Exports centralized paths for brand assets and gallery images used throughout the app.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with story sections, values list, and SEO metadata for the restaurant.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, quick actions, and a map section along with SEO metadata.",
  "frontend/src/pages/GalleryPage.tsx": "Shows an image gallery with a lightbox dialog, keyboard handling, and SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, cuisine highlights, actions, and brand elements.",
  "frontend/src/pages/MenuPage.tsx": "Provides a menu page with category grids and mobile accordion layout, using menu data and SEO metadata.",
  "frontend/src/pages/OffersPage.tsx": "Renders the restaurant offers page with SEO metadata, a hero section, and a list of promotional offer cards with icons and styled content.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, shadows, and plugin integrations.",
  "project_state.json": "Stores project metadata, known issues about image rendering and build errors, and lists existing and new feature requests related to gallery fixes and deployment issues."
}