{
  "backend/main.mo": "Minimal Motoko actor that includes blob storage mixin.",
  "feature_evidence.json": "Feature evidence report describing two menu‑data update features and affected files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base styles with OKLCH theme tokens for light/dark modes.",
  "frontend/index.html": "HTML entry point with favicon, SEO meta tags, OG/Twitter tags, and app root.",
  "frontend/src/App.tsx": "Sets up TanStack Router, layout, and all page routes including search.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo component with image fallback to text-based mark.",
  "frontend/src/components/GalleryImage.tsx": "Image card with loading pulse, hover effects, and graceful error fallback.",
  "frontend/src/components/HeaderSearch.tsx": "Search input + button component that submits trimmed query.",
  "frontend/src/components/LogoMotif.tsx": "Decorative logo motif with opacity and fallback text mark.",
  "frontend/src/components/MenuCategoryCarousel.tsx": "Carousel for menu categories with swipe, keyboard nav, and price formatting.",
  "frontend/src/components/MenuScreenshotGallery.tsx": "Renders a gallery showing the first menu screenshot with loading and error handling states.",
  "frontend/src/components/Section.tsx": "Provides a styled section wrapper with configurable classes and a container for layout consistency.",
  "frontend/src/components/Seo.tsx": "Updates document title and meta/OG tags dynamically based on provided SEO props.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with brand info, social links, navigation, and contact sections.",
  "frontend/src/components/SiteHeader.tsx": "Implements the site header with navigation, search, action buttons, and a responsive mobile menu.",
  "frontend/src/components/WatermarkBackground.tsx": "Shows layered low-opacity repeating watermark backgrounds for visual depth.",
  "frontend/src/data/menuData.ts": "Defines menu category and item data structures and exports a full menu dataset.",
  "frontend/src/draft24-exclusions.md": "Documents which changes were excluded during restoration to Draft 24 and lists included features.",
  "frontend/src/hooks/useActor.ts": "Creates and returns an authenticated or anonymous backend actor and manages invalidation on identity changes.",
  "frontend/src/hooks/useHorizontalSwipe.ts": "Provides a ref that detects horizontal swipe gestures and triggers optional left/right handlers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling login state, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks with no current logic.",
  "frontend/src/index.css": "Defines global Tailwind styles, font imports, and light/dark theme CSS variables for the app.",
  "frontend/src/lib/brandAssets.ts": "Exports centralized paths for brand images and a predefined gallery images list.",
  "frontend/src/lib/globalSearchContent.ts": "Builds search results for menu items, offers, and pages using normalized text matching.",
  "frontend/src/lib/menuPdf.ts": "Empty module reserved for future menu PDF logic.",
  "frontend/src/lib/menuPrice.ts": "Formats menu item prices, supporting numeric values, labels, and fallbacks.",
  "frontend/src/lib/menuScreenshotAssets.ts": "Exports an ordered list of menu screenshot asset URLs for deterministic page viewing.",
  "frontend/src/lib/socialLinks.ts": "Provides a central set of social media URLs for the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, story content, and feature highlights.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with hero section, restaurant contact details, quick actions, and map layout.",
  "frontend/src/pages/GalleryPage.tsx": "Empty or placeholder gallery page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Homepage displaying hero content, cuisine sections, CTAs, and feature highlights for the restaurant.",
  "frontend/src/pages/MenuPage.tsx": "Menu page with search, menu screenshots, filtered categories, and ordering CTA.",
  "frontend/src/pages/OffersPage.tsx": "Offers page listing promotional deals with styled cards and a terms section.",
  "frontend/src/pages/SearchPage.tsx": "Global search page that queries menu, offers, and pages, displaying grouped results with navigation.",
  "frontend/src/types/pdf-lib-global.d.ts": "Empty type declaration placeholder for pdf-lib global types.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, content scanning, extended colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state, tracking menu‑data update features and new requests for syncing menu content and verifying search behavior."
}