{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping high‑level features to frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of each frontend source file for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode tokens, and global layout defaults.",
  "frontend/index.html": "Main HTML entry with SEO metadata, Open Graph tags, favicon links, and root mount point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for all pages, rendering shared header and footer.",
  "frontend/src/components/Section.tsx": "Reusable section wrapper providing consistent spacing and container classes.",
  "frontend/src/components/Seo.tsx": "React component that updates document title and meta/OG tags on mount.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand info, navigation links, contact details, and social icons.",
  "frontend/src/components/SiteHeader.tsx": "Sticky responsive header with logo, navigation, CTAs, and mobile menu using Sheet.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Defines global styles, fonts, Tailwind layers, and light/dark theme CSS variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the restaurant's About page with story content, values, and styled sections.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, map info, and action buttons for reaching the restaurant.",
  "frontend/src/pages/GalleryPage.tsx": "Shows categorized image galleries with tabs and modal dialogs for enlarged viewing.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero banner, CTAs, highlights, and cuisine list using various UI components and SEO metadata.",
  "frontend/src/pages/MenuPage.tsx": "Menu page displaying categorized cuisines with items, a hero section, PDF download button, and SEO metadata.",
  "frontend/src/pages/OffersPage.tsx": "Offers page showing promotional deals with icons, descriptions, terms, and SEO metadata.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and enabling plugins for the project.",
  "project_state.json": "Project state metadata documenting design goals, requirements, images, and implemented features for the restaurant website."
}