{
  "backend/main.mo": "Minimal actor importing and including a blob storage mixin.",
  "feature_evidence.json": "Feature evidence report indicating the Mineral Water menu item price update in menuData.ts.",
  "frontend-file-summaries.txt": "Text file containing short summaries of multiple frontend files for reference.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry with SEO metadata, social tags, favicon, and script mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and all page routes including /search.",
  "frontend/src/components/BrandLogo.tsx": "Brand logo component with fallback text mark when the image fails to load.",
  "frontend/src/components/GalleryImage.tsx": "Displays a gallery image with loading skeleton, hover effects, and error fallback card.",
  "frontend/src/components/HeaderSearch.tsx": "Header search form with input, icon, and submit button calling onSubmit.",
  "frontend/src/components/LogoMotif.tsx": "Decorative logo motif with opacity and text fallback if image fails.",
  "frontend/src/components/MenuCategoryCarousel.tsx": "Interactive menu category carousel with keyboard, swipe navigation, and price badges.",
  "frontend/src/components/MenuScreenshotGallery.tsx": "Simple viewer showing the first menu screenshot with loading and error handling.",
  "frontend/src/components/Section.tsx": "Wrapper component providing consistent vertical spacing and container layout.",
  "frontend/src/components/Seo.tsx": "React component that updates document title and meta/OG tags when props change.",
  "frontend/src/components/SiteFooter.tsx": "Restaurant footer with brand section, social links, quick links, and contact info layout.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with navigation, search, mobile menu, and CTAs for ordering and booking.",
  "frontend/src/components/WatermarkBackground.tsx": "Renders fixed layered watermark background images with low opacity for subtle texture.",
  "frontend/src/data/menuData.ts": "Exports structured menu categories and items for juices, salads, soups, and more.",
  "frontend/src/draft24-exclusions.md": "Notes which changes from other drafts were excluded and documents the restored Draft 24 feature set.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates queries on change.",
  "frontend/src/hooks/useHorizontalSwipe.ts": "Hook providing left/right swipe detection via touch events and returns a ref for binding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login flow, identity storage, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for adding React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Defines global Tailwind styles, custom color variables, typography, and dark mode theming.",
  "frontend/src/lib/brandAssets.ts": "Exports paths for brand images and a list of gallery images with alt text.",
  "frontend/src/lib/globalSearchContent.ts": "Builds search results across menu items, offers, and site pages using text normalization and keyword matching.",
  "frontend/src/lib/menuPdf.ts": "Empty file reserved for future menu PDF utilities.",
  "frontend/src/lib/menuPrice.ts": "Formats menu item prices, supporting numeric, labeled, and fallback cases.",
  "frontend/src/lib/menuScreenshotAssets.ts": "Exports a deterministic ordered list of menu screenshot asset URLs.",
  "frontend/src/lib/socialLinks.ts": "Stores canonical social media profile URLs for the brand.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, story sections, values, and styled layout components.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with restaurant details, quick actions, and a map section using various UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage featuring hero content, cuisines list, calls to action, and branded visuals.",
  "frontend/src/pages/MenuPage.tsx": "Implements the menu page with search filtering, menu screenshots, and a category carousel.",
  "frontend/src/pages/OffersPage.tsx": "Displays a list of promotional offers with styled cards and a terms section.",
  "frontend/src/pages/SearchPage.tsx": "Provides global site search with grouped results for menu items, offers, and pages.",
  "frontend/src/types/pdf-lib-global.d.ts": "Empty type declaration file for pdf-lib globals.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions such as custom colors, typography, animations, and plugins.",
  "project_state.json": "Tracks project metadata, feature states, and a pending request to update the Mineral Water item price to ₹20."
}