{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing logo fix, fallback UI, and SEO image path features with associated files and metadata.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file’s purpose and recent branding/SEO updates.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry with favicon, SEO meta tags, and corrected OG/Twitter image paths.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for all main pages.",
  "frontend/src/components/BrandLogo.tsx": "Brand logo component with size options and error fallback to text-based mark.",
  "frontend/src/components/LogoMotif.tsx": "Decorative low-opacity logo motif with fallback to text if the image fails.",
  "frontend/src/components/Section.tsx": "Reusable section wrapper providing consistent spacing and container layout.",
  "frontend/src/components/Seo.tsx": "Dynamically updates document title and meta tags including OG fields.",
  "frontend/src/components/SiteFooter.tsx": "Footer with branding, navigation links, contact info, and social icons using BrandLogo.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with navigation links, CTAs, and a mobile slide-out menu.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor, updating when Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity auth state, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend-related React Query hooks.",
  "frontend/src/index.css": "Global Tailwind-based styles defining typography, theming variables, and dark mode palettes.",
  "frontend/src/lib/brandAssets.ts": "Exports centralized paths for logo, favicon, and hero images.",
  "frontend/src/main.tsx": "App entry point wiring React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "About page describing the restaurant’s story, values, and global cuisine focus with styled sections.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing location, phone, hours, quick actions, and a map layout.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery page with tabbed categories and modal image previews using a static list of images.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero, cuisine highlights, and action buttons for booking or ordering, using brand assets and navigation.",
  "frontend/src/pages/MenuPage.tsx": "Shows menu categories with descriptions and items, plus a hero section and a button to download the full menu PDF.",
  "frontend/src/pages/OffersPage.tsx": "Lists promotional offers with styled cards and a hero section, including terms and conditions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, shadows, and container settings.",
  "project_state.json": "Tracks project metadata, issues, and feature requirements focused on fixing missing logo assets and ensuring consistent branding."
}