{
  "kind": "build_request",
  "title": "Fix gallery images not rendering and unblock build/deployment configuration error",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Gallery page so the ambience images reliably render as thumbnails and in the lightbox by ensuring all referenced image paths point to static files that exist in the deployed frontend assets (and are served correctly in production).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "images not visible"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /gallery shows a 2/3-column responsive grid where each card displays a visible image (not a blank/empty tile).",
        "Clicking/tapping any thumbnail opens the lightbox with the larger image visible.",
        "No gallery image requests return 404/failed network requests in the browser devtools when running the production build."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make gallery image loading robust against filename/path issues (e.g., spaces or special characters) by updating asset filenames and/or references so they work consistently across environments, and add a graceful UI fallback when an image fails to load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "images not visible"
        ]
      },
      "acceptanceCriteria": [
        "Gallery image URLs used in code do not rely on unencoded spaces/special characters that can break on some static hosting paths.",
        "If any gallery image fails to load, the UI displays a visible fallback state for that tile (without breaking the grid layout)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Investigate and fix the build/deployment configuration error so the app can build and deploy successfully without requiring manual intervention from the Caffeine team.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "⚠️ A configuration error has occurred. Please notify the Caffeine team.",
          "yes please"
        ]
      },
      "acceptanceCriteria": [
        "A clean build completes successfully in the target deployment environment (no configuration error).",
        "The deployed site loads successfully and the Gallery page images are visible in the deployed environment."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit the immutable hook entrypoints listed in SYSTEM_CONTEXT (compose around them if needed).",
    "Keep backend as a single Motoko actor in backend/main.mo; only add migration files if state upgrades are required."
  ],
  "nonGoals": [
    "Adding new gallery features beyond fixing visibility/reliability (e.g., uploads, admin editing, reordering, tagging).",
    "Introducing third-party services or external storage/CDNs for images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}