{
  "kind": "build_request",
  "title": "Fix missing logo rendering across the site",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the site logo not appearing by ensuring the referenced logo asset exists in the frontend static assets and that all logo references point to the correct, existing filename/path (centralized in frontend/src/lib/brandAssets.ts).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the logo didnt appear"
        ]
      },
      "acceptanceCriteria": [
        "The logo image loads successfully (no broken-image icon) in the SiteHeader, SiteFooter, HomePage hero, and LogoMotif components.",
        "BRAND_ASSETS.logo in frontend/src/lib/brandAssets.ts points to a file that exists under the frontend’s publicly served static assets (e.g., /assets/generated/...).",
        "Hard-refreshing the deployed site still shows the logo (not dependent on cache)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add resilient UI fallbacks for the logo <img> elements so that if the logo asset fails to load, users still see a visible brand mark (e.g., a small text fallback or simple inline SVG) without layout breakage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the logo didnt appear"
        ]
      },
      "acceptanceCriteria": [
        "If the logo image fails to load, the header/footer/hero do not show a broken-image icon and instead show a clean fallback while preserving spacing/alignment.",
        "When the logo loads normally, no fallback is visible and the UI matches the intended design."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure SEO and social meta image references in frontend/index.html use the same correct logo asset path as the rest of the app (via the canonical generated logo filename) so the site’s OG/Twitter images are not broken.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the logo didnt appear"
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html og:image and twitter:image reference a valid, existing asset path that returns the image successfully.",
        "Favicon reference remains valid and loads correctly in the browser tab."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Keep the backend unchanged unless strictly necessary; this issue should be solved via frontend static assets and references."
  ],
  "nonGoals": [
    "Adding new pages or changing the website’s information architecture.",
    "Implementing new authentication or backend data features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Normalize uploaded logo into optimized square PNG (Screenshot 2026-02-07 154246.png > taste-tales-logo.dim_512x512.png)",
      "Derive a high-contrast favicon from the uploaded logo (Screenshot 2026-02-07 154246.png > taste-tales-favicon.dim_64x64.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}