{
  "kind": "build_request",
  "title": "Make the frontend fully responsive across mobile, tablet (iPad), and desktop",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the entire frontend layout is responsive and usable across common breakpoints (mobile, tablet/iPad, laptop/desktop), with no horizontal scrolling or clipped content on any page (Home, About, Menu, Offers, Contact, and Menu Management).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make is feasible to all devices like mobile,ipad,laptop"
        ]
      },
      "acceptanceCriteria": [
        "At viewport widths ~360px (mobile), ~768px (tablet), and ~1280px (desktop), every route renders without horizontal scrolling.",
        "No text, buttons, cards, images, or dialogs overflow their containers; content reflows appropriately.",
        "Tap targets on mobile (buttons/links) are not cramped and remain accessible without accidental taps."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the header navigation and header contents to be responsive at mobile/tablet/desktop sizes, including appropriate spacing, wrapping behavior, and avoidance of overflow for the brand name, search bar, and nav actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make is feasible to all devices like mobile,ipad,laptop"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, the hamburger menu and mobile nav render without overflow; opening the menu shows all links and the search input fully within the viewport.",
        "On tablet sizes, the header does not feel cramped: spacing is balanced and elements do not overlap; the search and nav are displayed using appropriate breakpoints.",
        "On desktop, the existing layout (logo + search + nav + social) remains aligned, with consistent vertical centering and no layout shift when navigating between pages."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make key page grids/sections responsive, especially the Home page hero, cuisine card grid, and any multi-column sections, so that typography scales and layout transitions cleanly from single-column (mobile) to multi-column (tablet/desktop).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make is feasible to all devices like mobile,ipad,laptop"
        ]
      },
      "acceptanceCriteria": [
        "Home page hero content (logo, heading, subtitle, CTA buttons) fits on mobile screens without clipping and with readable line-lengths.",
        "Cuisine cards display as 1 column on small screens, 2 columns on small/medium screens where appropriate, and 3–4 columns on larger screens (no awkward partial columns or overflow).",
        "Images keep correct aspect ratios and do not stretch; they remain within their cards/containers at all breakpoints."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make the Menu Management page responsive, including the tab list, forms, and action buttons, so it remains usable on mobile and tablet (no tabs or form inputs extending off-screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make is feasible to all devices like mobile,ipad,laptop"
        ]
      },
      "acceptanceCriteria": [
        "TabsList remains usable on narrow screens (wraps cleanly or becomes horizontally scrollable without breaking layout).",
        "Form grids (category fields and item fields) stack into a single column on mobile and become multi-column on larger viewports.",
        "Primary actions (Save Changes / Reset / Logout) remain visible and usable on mobile without forcing sideways scrolling."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Verify and refine footer responsiveness so its grid collapses appropriately on smaller devices and maintains readable spacing and alignment for contact and social sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make is feasible to all devices like mobile,ipad,laptop"
        ]
      },
      "acceptanceCriteria": [
        "Footer sections render as a single-column stack on mobile, two columns on medium screens, and up to four columns on large screens, without overlap.",
        "Contact rows (address/phone/hours) wrap neatly without icon/text collision.",
        "Footer links and buttons remain readable and do not overflow their containers."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend changes are not required for responsiveness; keep the Motoko canister logic unchanged unless a blocking UI issue is found. (If state/schema changes are needed, add a migration only under the conditional migration policy.)"
  ],
  "nonGoals": [
    "Adding new pages or new business features unrelated to responsive layout.",
    "Changing authentication behavior (Internet Identity) or backend access control.",
    "Implementing real-time features or external integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}