{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restaurant menu standardization, media system, ordering, and staff management UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the default menu dataset with a cleaned/standardized version while preserving all existing categories/items.",
      "acceptanceCriteria": [
        "`frontend/src/data/menuData.ts` compiles with no TypeScript errors.",
        "Category names and item names are consistently formatted (e.g., Title Case or a single chosen convention applied everywhere), with obvious typos corrected (e.g., inconsistent spellings like 'CUISIN').",
        "Duplicate/contradictory entries in the dataset are resolved in a deterministic way (no identical items with conflicting prices within the same category).",
        "All menu entries continue to render on `/menu` without runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/menuData.ts",
          "operation": "modify",
          "description": "Replace the current exported dataset with the newer cleaned/standardized version: normalize category/item naming (single convention), fix obvious typos, remove deterministic duplicates with conflicting prices, and ensure all previously represented categories/items remain present. Add stable identifiers and metadata fields needed by the new ordered/icon/cover-image rendering (while keeping a safe fallback export for existing imports)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Introduce explicit category ordering (optionally grouping) and render the menu in that order on both desktop grid and mobile accordion.",
      "acceptanceCriteria": [
        "Categories render in the specified order on both desktop and mobile layouts.",
        "Reordering does not change the content of categories/items (only presentation order/grouping).",
        "The menu page remains responsive and readable at common breakpoints (mobile and desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/menuData.ts",
          "operation": "modify",
          "description": "Add an explicit category ordering mechanism (e.g., `order` number and optional `group` label) to the default menu dataset so presentation order is deterministic and editable later."
        },
        {
          "path": "frontend/src/pages/MenuPage.tsx",
          "operation": "modify",
          "description": "Update `/menu` rendering to sort categories by the new explicit order (and optionally render group headings) consistently for both the desktop grid and mobile accordion layouts."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve and standardize category and item descriptions in English across the menu dataset.",
      "acceptanceCriteria": [
        "Each category has a clear English description.",
        "Menu items that previously had missing/placeholder descriptions are updated where appropriate, without introducing extremely long text blocks that break layout.",
        "No non-English strings are introduced into the menu UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/menuData.ts",
          "operation": "modify",
          "description": "Enhance category descriptions and fill/standardize item descriptions where missing/low-quality. Ensure all user-facing strings are concise, consistent in tone/length, and English-only."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a consistent icon and optional cover image system per category, rendered cleanly on the menu page with graceful fallbacks.",
      "acceptanceCriteria": [
        "Each category renders a consistent icon style (not a mix of random emoji styles), and the UI spacing/alignment is consistent across categories.",
        "Category cover images (from `frontend/public/assets/generated`) render without layout shift and include meaningful `alt` text.",
        "If an image is missing for a category, the UI falls back gracefully (still looks good and remains aligned)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/menuData.ts",
          "operation": "modify",
          "description": "Replace emoji icons with a standardized icon reference (e.g., `iconKey`) and add optional `coverImage` path per category referencing static assets under `frontend/public/assets/generated`."
        },
        {
          "path": "frontend/src/components/menu/MenuCategoryIcon.tsx",
          "operation": "create",
          "description": "Create a small presentational component that renders a consistent monochrome icon style for a category using `frontend/public/assets/generated/menu-icons-sheet.dim_2048x2048.png` (sprite-sheet based) and provides a readable fallback when an iconKey is missing."
        },
        {
          "path": "frontend/src/pages/MenuPage.tsx",
          "operation": "modify",
          "description": "Update category headers to display the standardized icon via `MenuCategoryIcon` and display an optional cover image from `frontend/public/assets/generated/*.png` with fixed aspect ratio/reserved space to avoid layout shift, meaningful `alt` text, and a graceful no-image layout."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add an authenticated staff-only “Menu Management” page (Internet Identity) to edit names/prices (and optionally descriptions and category order) and save via the backend; public menu falls back to default data when no persisted menu exists.",
      "acceptanceCriteria": [
        "A new staff-only UI exists to edit: category name/description/order and item name/price (and optionally description).",
        "Edits persist after page refresh (data is stored in the Motoko canister, not only in frontend state).",
        "The public `/menu` page reads from the persisted menu when available; if no persisted menu exists yet, it falls back to the default dataset from `frontend/src/data/menuData.ts`.",
        "Unauthorized users cannot access save/update functionality (page is blocked or read-only when not authenticated/authorized)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement React Query hooks for menu management using the backend actor: load current menu (`getMenu`), check admin status (`isCallerAdmin`/`getCallerUserRole`), and save updates (`updateMenu`). Use the selected \"authorization\" component patterns for authenticated calls and for handling authorization errors gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/menuAdapters.ts",
          "operation": "create",
          "description": "Add conversion utilities between the default menu dataset shape and the backend `MenuData` shape (categories/items arrays). Include deterministic ID generation/mapping for default data and a merge/fallback strategy for when the backend has no initialized menu data yet."
        },
        {
          "path": "frontend/src/pages/MenuManagementPage.tsx",
          "operation": "create",
          "description": "Create a staff-only Menu Management page with forms to edit category name/description/order and item name/price (optionally description), plus Save/Reset actions. Use Internet Identity authentication and admin-guarding based on the selected \"authorization\" component guidance (block or read-only when not authorized). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route for the Menu Management page (e.g., `/menu-management`) and wire it into the router so it is navigable."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add a navigation entry (desktop + mobile) for “Menu Management” that is only shown when the user is authenticated and authorized (admin). Use the selected \"authorization\" component guidance for role-based access UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MenuPage.tsx",
          "operation": "modify",
          "description": "Change the public `/menu` page to load menu data from the backend when available (via new query hooks) and fall back to the default dataset from `frontend/src/data/menuData.ts` when the persisted menu is not initialized or cannot be fetched unauthenticated. Handle authorization-related failures without breaking the public menu."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update menu item rows/cards to show optional item descriptions in a standardized name + description + price layout without harming readability.",
      "acceptanceCriteria": [
        "If `description` exists for an item, it is displayed under the item name with muted styling and appropriate wrapping.",
        "If `description` is missing, the layout remains aligned (no awkward gaps).",
        "Prices remain consistently formatted as INR with the ₹ symbol as currently shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MenuPage.tsx",
          "operation": "modify",
          "description": "Update both desktop card rows and mobile accordion rows to render item description (when present) beneath the name with muted/secondary styling and consistent spacing; keep price formatting with ₹ and align rows when descriptions are absent."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add required generated static assets for menu cover images and icon sheet under `frontend/public/assets/generated` and reference them from the menu UI via static paths.",
      "acceptanceCriteria": [
        "All required generated images are present under `frontend/public/assets/generated` and are referenced via static paths.",
        "No backend endpoints are added for serving images.",
        "Build succeeds and images appear in the menu UI where intended."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/menu-cover-soups.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Soups category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-starters.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Appetizers/Starters category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-tandoori.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Tandoori/Grill category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-sizzlers.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Sizzlers category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-indian-mains.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Indian Mains/Curries category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-oriental.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Oriental/Asian Mains category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-rice.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Rice & Biryani category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-breads.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Breads category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-desserts.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Desserts category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-cover-beverages.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated static cover image asset for the Beverages/Juices/Shakes category at the exact path specified."
        },
        {
          "path": "frontend/public/assets/generated/menu-icons-sheet.dim_2048x2048.png",
          "operation": "create",
          "description": "Add the generated monochrome line icon sprite sheet at the exact path specified for consistent category icons."
        },
        {
          "path": "frontend/src/data/menuData.ts",
          "operation": "modify",
          "description": "Wire the new static asset paths into the default dataset by assigning each category an optional `coverImage` referencing the correct file in `frontend/public/assets/generated` and an `iconKey` mapping for the standardized icon renderer."
        }
      ]
    }
  ]
}