{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix logo asset paths and add resilient logo fallbacks",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the logo static asset exists and all logo references use the canonical path centralized in brandAssets.",
      "acceptanceCriteria": [
        "The logo image loads successfully (no broken-image icon) in the SiteHeader, SiteFooter, HomePage hero, and LogoMotif components.",
        "BRAND_ASSETS.logo in frontend/src/lib/brandAssets.ts points to a file that exists under the frontend’s publicly served static assets (e.g., /assets/generated/...).",
        "Hard-refreshing the deployed site still shows the logo (not dependent on cache)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/taste-tales-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the canonical generated logo asset so BRAND_ASSETS.logo can reference an existing publicly served file (source: generated/taste-tales-logo.dim_512x512.png)."
        },
        {
          "path": "frontend/public/assets/generated/taste-tales-favicon.dim_64x64.png",
          "operation": "create",
          "description": "Add the canonical generated favicon asset so BRAND_ASSETS.favicon and index.html can reference an existing publicly served file (source: generated/taste-tales-favicon.dim_64x64.png)."
        },
        {
          "path": "frontend/src/lib/brandAssets.ts",
          "operation": "modify",
          "description": "Update BRAND_ASSETS.logo to the existing canonical path /assets/generated/taste-tales-logo.dim_512x512.png (currently points to a non-existent taste-tales-logo-uploaded file) and confirm favicon/hero paths match existing assets."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Ensure all logo <img> references use the centralized BRAND_ASSETS.logo (no hardcoded or stale filenames) in both desktop and mobile header logo areas."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Ensure the footer logo <img> references use the centralized BRAND_ASSETS.logo (no hardcoded or stale filenames)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the HomePage hero logo <img> references use the centralized BRAND_ASSETS.logo (no hardcoded or stale filenames)."
        },
        {
          "path": "frontend/src/components/LogoMotif.tsx",
          "operation": "modify",
          "description": "Ensure the LogoMotif decorative logo uses the centralized BRAND_ASSETS.logo (no hardcoded or stale filenames)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add resilient fallbacks for logo images so failed loads show a clean brand mark without layout breakage.",
      "acceptanceCriteria": [
        "If the logo image fails to load, the header/footer/hero do not show a broken-image icon and instead show a clean fallback while preserving spacing/alignment.",
        "When the logo loads normally, no fallback is visible and the UI matches the intended design."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrandLogo.tsx",
          "operation": "create",
          "description": "Create a shared BrandLogo component that renders the logo using BRAND_ASSETS.logo and provides an onError-driven fallback (e.g., text mark or inline SVG) while preserving the same sizing/box dimensions as the image."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Replace direct logo <img> usage with the shared BrandLogo component in both desktop and mobile header to prevent broken-image icons and preserve layout."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Replace direct logo <img> usage with the shared BrandLogo component in the footer to provide a consistent fallback and avoid layout shifts."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace the hero logo <img> with the shared BrandLogo component so the hero shows a clean fallback if the logo fails to load, without breaking spacing/alignment."
        },
        {
          "path": "frontend/src/components/LogoMotif.tsx",
          "operation": "modify",
          "description": "Update LogoMotif to use the shared BrandLogo component (or equivalent fallback logic) with the existing decorative opacity styling, ensuring no broken-image icon appears if loading fails."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Align SEO/social meta image references in index.html to the canonical, existing logo asset path while keeping favicon valid.",
      "acceptanceCriteria": [
        "frontend/index.html og:image and twitter:image reference a valid, existing asset path that returns the image successfully.",
        "Favicon reference remains valid and loads correctly in the browser tab."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update og:image and twitter:image to reference the canonical existing logo asset path /assets/generated/taste-tales-logo.dim_512x512.png, and confirm the favicon link continues to reference a valid existing asset (/assets/generated/taste-tales-favicon.dim_64x64.png)."
        }
      ]
    }
  ]
}